<a href="https://colab.research.google.com/github/bzizmza/bzizmza/blob/main/DattabotTechnicalTest_DataEngineer_AbimanyuSriSetyo.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Dattabot Technical Test - Data Engineer
by Abimanyu Sri Setyo

>[Dattabot Technical Test - Data Engineer](#scrollTo=rNT7fB6QSb2G)

>>[Loading a Dataset from the Google Drive to Google Colab](#scrollTo=PcZFrchWTkea)

>>>[Mounting my Google Drive](#scrollTo=mlt6HvVfUkyG)

>>>[Then, it reads the .xlsx file and converts each sheet to dataset1, dataset2, and dataset3.](#scrollTo=1PgxO246UoEk)

>>>[Ensure dataset1, dataset2, and dataset3 have an "Employee_ID" column that contains a unique value before merging.](#scrollTo=UQ4lCo9k805i)

>>>[Merge dataset1, dataset2, and dataset3 to dataset with key 'Employee_ID'](#scrollTo=Gv8jGiejYyZQ)

>>[Cleaning dataset](#scrollTo=x5qRXV5H-gBE)

>>>[Check data before cleaning](#scrollTo=nrerG9jLTpMv)

>>>[Cleaning data in the 'Employee_ID' column](#scrollTo=8-LkHZJDP8vs)

>>>>[See information in the 'Employee_ID' column](#scrollTo=J5XMLilfQmc-)

>>>>[Checking the unique amount of data in the 'Employee_ID' column, from here it will also be seen whether there is duplicate data](#scrollTo=n9OAkq2TQqeJ)

>>>[Cleaning data in the 'Name' column](#scrollTo=rN4twMIQAewj)

>>>>[Checks whether the "Name" column contains non-letter characters or other special characters that are irrelevant in people's names.](#scrollTo=rBjlrXiBBLMC)

>>>>[Replaces unwanted characters with empty strings](#scrollTo=H1FCs-_vC0vQ)

>>>>[Re-check the "name" column, if the column only contains letters it will not display anything](#scrollTo=geX8i54oDt2f)

>>>[Cleaning data in the 'Gender' column](#scrollTo=5B4fnYdMD8m0)

>>>>[Checking irregular writing in the 'Gender' column](#scrollTo=RWirsSkdMNRR)

>>>>[Change 'M', 'Male', 'Pria', 'Man', 'Laki-laki' to 'Male'](#scrollTo=q--P1bG5N3ak)

>>>>[Change 'F', 'Perempuan', 'Wanita', 'Female' to 'Female'](#scrollTo=sPLUa_RlOJUB)

>>>>[Re-check the contents of the data in the 'Gender' column](#scrollTo=gN8zmy9bOm4H)

>>>[Cleaning data in the 'EDU_LVL' column](#scrollTo=6g8nHBlqPPH9)

>>>>[Checking irregular writing in the 'Gender' column](#scrollTo=t8cwBpTGPjTe)

>>>[Cleaning data in the 'JOB_CATEGORY' column](#scrollTo=JDZFNnn4Pvyi)

>>>>[Checking irregular writing in the 'JOB_CATEGORY' column](#scrollTo=zrt_HEywWjWu)

>>>[Cleaning data in the 'AGE' column](#scrollTo=0m4zi4CcTlfq)

>>>>[Separates the age column into a component of the year, month and day](#scrollTo=tEszMAmTVVWg)

>>>>[Calculate the date of birth based on components of the year, month, and day](#scrollTo=JTu3pocaWOi6)

>>>>[Drop the 'age' column from dataset and change the sequence of the column so that the 'Birthdate' column is in the position that was previously occupied by the 'Age' column column](#scrollTo=k7ZYgyb2jCox)

>>>[Cleaning data in the 'Score' column](#scrollTo=AsjCAB3yYPo7)

>>>>[Check information from the column](#scrollTo=GSHUrLL2-4Ea)

>>>>[Checking the null in the 'Score' column](#scrollTo=3kqHgaE8_ESG)

>>>>[Convert the 'Score' column to the numerical data type](#scrollTo=ixPvRGN5Baxq)

>>>>[Replace the NULL in the 'Score' column with an average value](#scrollTo=APBYcUPr_iV9)

>>>>[Re-checking null in the 'score' column](#scrollTo=p3a3iyY-CUMV)

>>>[Cleaning data in the 'Phone Number' column](#scrollTo=eqk-76duCgRK)

>>>>[Change the data type column 'Phone Number' to String](#scrollTo=wja7SOieMt2h)

>>>>[Extraction telephone number patterns and count the number of telephone number emergence](#scrollTo=FiM27-z5Pdfd)

>>>>[Change unwanted prefix with a consistent prefix](#scrollTo=RQUGzg6hQKvs)

>>>[Cleaning data in the 'Domicile_Province' column](#scrollTo=ddy8YfVeQmLT)

>>>>[Make a Dictionary for Mapping](#scrollTo=YFz9XF9HQ61k)

>>>>[Change the column value 'Domicile_Province' using mapping](#scrollTo=-BYfjqyLSfEg)

>>>[Cleaning data in the 'First_Day_Employment' column](#scrollTo=fTcU7fTeTHR_)

>>>>[Determine the expected pattern from the date format](#scrollTo=61J_xYnAT_D-)

>>>>[Make a special function to convert the date format](#scrollTo=QQFn2dokBZBd)

>>>>[Conversion Value Using Special Functions](#scrollTo=Ojmy7_t6BkP3)

>>>>[Then, print data and check whether there is data that is in the column](#scrollTo=x7jWIjHvCFwA)

>>>[Check data after cleaning](#scrollTo=OcGfQIN7T5Hx)

## Loading a Dataset from the Google Drive to Google Colab

### Mounting my Google Drive

In [ ]:
from google.colab import drive
drive.mount('/content/drive')

Drive already mounted at /content/drive; to attempt to forcibly remount, call drive.mount("/content/drive", force_remount=True).

### Then, it reads the .xlsx file and converts each sheet to dataset1, dataset2, and dataset3.

In [ ]:
import pandas as pd

dataset1 = pd.read_excel('drive/MyDrive/DattabotTechnicalTest_DataEngineer/dataset2022.xlsx', "dataset1")

# check the dataset1
dataset1.head(5)

,Employee_ID,Name,GENDER,EDU_LVL,JOB_CATEGORY,AGE,Score,Phone Number,Domicile_Province,First_Day_Employment
0,1,Claire Gute,M,S1,Functional Expert Band 2,"37 years, 2 month, 11 days",3.98,628315242420,DKI Jakarta,2006-02-16
1,2,Darrin Van Huff,M,S2,Manager,"42 years, 3 month, 14 days",4.15,85246790036,Jakarta,12-20-2002
2,3,Sean O'Donnell,Male,SLTA,Staff,"48 years, 4 month, 25 days",3.98,85246833311,JKT,1997-08-20
3,4,Brosina Hoffman,M,S2,Manager,"50 years, 7 month, 2 days",3.23,85246990032,West Java,06/19/1993
4,5,Andrew Allen,F,S1,Trainee,"20 years, 4 month, 8 days",-,85247028027,Jawa Barat,06-25-2020

In [ ]:
dataset1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 340 entries, 0 to 339
Data columns (total 10 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   Employee_ID           340 non-null    int64
 1   Name                  340 non-null    object
 2   GENDER                340 non-null    object
 3   EDU_LVL               340 non-null    object
 4   JOB_CATEGORY          340 non-null    object
 5   AGE                   340 non-null    object
 6   Score                 333 non-null    object
 7   Phone Number          340 non-null    int64
 8   Domicile_Province     340 non-null    object
 9   First_Day_Employment  340 non-null    object
dtypes: int64(2), object(8)
memory usage: 26.7+ KB

In [ ]:
dataset2 = pd.read_excel('drive/MyDrive/DattabotTechnicalTest_DataEngineer/dataset2022.xlsx', "dataset2")

# check the dataset2
dataset2.head(5)

,Employee_ID,Name,GENDER,EDU_LVL,JOB_CATEGORY,AGE,Score,Phone Number,Domicile_Province,First_Day_Employment
0,341,Darrin Sayre,F,S1,Staff,"29 years, 9 month, 12 days",3.55,628315298115,Purwokerto,03-15-2016
1,342,Gary Zandusky,M,S2,Staff,"24 years, 9 month, 7 days",3.47,85246794110,Purwakarta,02-21-2020
2,343,Phillina Ober,F,S2,Staff,"33 years, 1 month, 3 days",3.7,85246860540,Yogyakarta,12/22/2011
3,344,Sung Shariari,M,S1,Staff,"42 years, 2 month, 18 days",4.6,85246975220,DIY,09-26-2005
4,345,Maya Herman,M,S1,Functional Expert Band 2,"28 years, 7 month, 4 days",3.11,85247092105,Depok,03-17-2015

In [ ]:
dataset2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 292 entries, 0 to 291
Data columns (total 10 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   Employee_ID           292 non-null    int64
 1   Name                  292 non-null    object
 2   GENDER                292 non-null    object
 3   EDU_LVL               292 non-null    object
 4   JOB_CATEGORY          292 non-null    object
 5   AGE                   292 non-null    object
 6   Score                 292 non-null    object
 7   Phone Number          292 non-null    int64
 8   Domicile_Province     292 non-null    object
 9   First_Day_Employment  292 non-null    object
dtypes: int64(2), object(8)
memory usage: 22.9+ KB

In [ ]:
dataset3 = pd.read_excel('drive/MyDrive/DattabotTechnicalTest_DataEngineer/dataset2022.xlsx', "dataset3")

# check the dataset3
dataset3.head(5)

,Employee_ID,Name,GENDER,EDU_LVL,JOB_CATEGORY,AGE,Score,Phone Number,Domicile_Province,First_Day_Employment
0,633,Michael Nguyen,M,S1,Staff,"26 years, 7 month, 8 days",3.73,6285247875220,Bekasi,2017-01-20
1,634,Harold Pawlan,M,S1,Functional Expert Band 2,"37 years, 7 month, 6 days",3.96,85247990049,Tangerang Selatan,11-15-2009
2,635,Jim Radford,M,S1,Staff,"44 years, 6 month, 8 days",4.16,8524796457,Kalideres,04/16/2000
3,636,Jamie Frazer,M,S1,Staff,"28 years, 1 month, 10 days",4,85247990008,Sukabumi,10/16/2018
4,637,Chad McGuire,Male,S1,Manager,"38 years, 9 month, 16 days",3.24,85247910011,Bali,2008-02-18

In [ ]:
dataset3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 298 entries, 0 to 297
Data columns (total 10 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   Employee_ID           298 non-null    int64
 1   Name                  298 non-null    object
 2   GENDER                298 non-null    object
 3   EDU_LVL               298 non-null    object
 4   JOB_CATEGORY          298 non-null    object
 5   AGE                   298 non-null    object
 6   Score                 295 non-null    object
 7   Phone Number          298 non-null    int64
 8   Domicile_Province     298 non-null    object
 9   First_Day_Employment  298 non-null    object
dtypes: int64(2), object(8)
memory usage: 23.4+ KB

### Ensure dataset1, dataset2, and dataset3 have an "Employee_ID" column that contains a unique value before merging.

In [ ]:
duplicated_rows1 = dataset1.duplicated(subset='Employee_ID')
duplicated_rows2 = dataset2.duplicated(subset='Employee_ID')
duplicated_rows3 = dataset3.duplicated(subset='Employee_ID')

print("Jumlah duplikat dalam dataset1:", duplicated_rows1.sum())
print("Jumlah duplikat dalam dataset2:", duplicated_rows2.sum())
print("Jumlah duplikat dalam dataset3:", duplicated_rows3.sum())

Jumlah duplikat dalam dataset1: 0
Jumlah duplikat dalam dataset2: 0
Jumlah duplikat dalam dataset3: 0

### Merge dataset1, dataset2, and dataset3 to dataset with key 'Employee_ID'

In [ ]:
dataset = pd.concat([dataset1, dataset2, dataset3], ignore_index=True)
dataset.head(5)

,Employee_ID,Name,GENDER,EDU_LVL,JOB_CATEGORY,AGE,Score,Phone Number,Domicile_Province,First_Day_Employment
0,1,Claire Gute,M,S1,Functional Expert Band 2,"37 years, 2 month, 11 days",3.98,628315242420,DKI Jakarta,2006-02-16
1,2,Darrin Van Huff,M,S2,Manager,"42 years, 3 month, 14 days",4.15,85246790036,Jakarta,12-20-2002
2,3,Sean O'Donnell,Male,SLTA,Staff,"48 years, 4 month, 25 days",3.98,85246833311,JKT,1997-08-20
3,4,Brosina Hoffman,M,S2,Manager,"50 years, 7 month, 2 days",3.23,85246990032,West Java,06/19/1993
4,5,Andrew Allen,F,S1,Trainee,"20 years, 4 month, 8 days",-,85247028027,Jawa Barat,06-25-2020

In [ ]:
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 930 entries, 0 to 929
Data columns (total 10 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   Employee_ID           930 non-null    int64
 1   Name                  930 non-null    object
 2   GENDER                930 non-null    object
 3   EDU_LVL               930 non-null    object
 4   JOB_CATEGORY          930 non-null    object
 5   AGE                   930 non-null    object
 6   Score                 920 non-null    object
 7   Phone Number          930 non-null    int64
 8   Domicile_Province     930 non-null    object
 9   First_Day_Employment  930 non-null    object
dtypes: int64(2), object(8)
memory usage: 72.8+ KB

## Cleaning dataset

### Check data before cleaning

In [ ]:
dataset.head(20)

,Employee_ID,Name,GENDER,EDU_LVL,JOB_CATEGORY,AGE,Score,Phone Number,Domicile_Province,First_Day_Employment
0,1,Claire Gute,M,S1,Functional Expert Band 2,"37 years, 2 month, 11 days",3.98,628315242420,DKI Jakarta,2006-02-16
1,2,Darrin Van Huff,M,S2,Manager,"42 years, 3 month, 14 days",4.15,85246790036,Jakarta,12-20-2002
2,3,Sean O'Donnell,Male,SLTA,Staff,"48 years, 4 month, 25 days",3.98,85246833311,JKT,1997-08-20
3,4,Brosina Hoffman,M,S2,Manager,"50 years, 7 month, 2 days",3.23,85246990032,West Java,06/19/1993
4,5,Andrew Allen,F,S1,Trainee,"20 years, 4 month, 8 days",-,85247028027,Jawa Barat,06-25-2020
5,6,Irene Maddox,M,S1,Supervisor,"37 years, 1 month, 17 days",4.66,85247198103,Jabar,02-15-2006
6,7,Harold Pawlan,Pria,S1,Senior Staff Band 2,"43 years, 1 month, 2 days",4.71,6285247276106,Bandung,2003-03-22
7,8,Pete Kriz,Man,S1,Staff,"27 years, 8 month, 14 days",4.05,6285247353711,Jakarta Selatan,2020-06-19
8,9,Alejandro Grove,M,S1,Staff,"26 years, 1 month, 14 days",4.86,6285247484084,South Jakarta,02/24/2020
9,10,Zuschuss Donatelli,F,S1,Staff,"32 years, 4 month, 1 days",3.76,6285247594109,East Jakarta,10-25-2015
10,11,Ken Black,F,D3,Staff,"41 years, 3 month, 24 days",3.42,6285247668025,Purwokerto,06/23/2005
11,12,Sandra Flanagan,Laki-laki,S1,Supervisor,"40 years, 7 month, 22 days",4.07,6285247719140,Purwakarta,2005-07-17
12,13,Emily Burns,M,S1,Supervisor,"29 years, 5 month, 15 days",4.29,6285247884057,Yogyakarta,03/26/2015
13,14,Eric Hoffmann,F,S1,Functional Expert Band 2,"32 years, 2 month, 6 days",4,85247990049,DIY,01/20/2011
14,15,Tracy Blumstein,F,S1,Staff,"31 years, 8 month, 24 days",4.07,85247919140,Depok,09-16-2015
15,16,Matt Abelman%,M,D3,Manager,"40 years, 6 month, 21 days",3.83,85247977095,Bogor,05-26-2003
16,17,"Gene Hale,,",Man,S1,Functional Expert Band 2,"44 years, 2 month, 9 days",4.26,85247975080,Bekasi,11-19-2002
17,18,Steve Nguyen!,Pria,S1,Supervisor,"35 years, 7 month, 12 days",3.9,85247977041,Tangerang Selatan,06-26-2010
18,19,Linda Cazamias,F,S1,Staff,"24 years, 9 month, 19 days",3.98,85247960540,Kalideres,2020-12-21
19,20,Ruben Ausman,M,S2,Manager,"34 years, 8 month, 10 days",4.14,85247990049,Sukabumi,2012-03-20

### Cleaning data in the 'Employee_ID' column

#### See information in the 'Employee_ID' column

In [ ]:
dataset['Employee_ID'].info()

<class 'pandas.core.series.Series'>
RangeIndex: 930 entries, 0 to 929
Series name: Employee_ID
Non-Null Count  Dtype
--------------  -----
930 non-null    int64
dtypes: int64(1)
memory usage: 7.4 KB

#### Checking the unique amount of data in the 'Employee_ID' column, from here it will also be seen whether there is duplicate data

In [ ]:
dataset['Employee_ID'].nunique()

930

### Cleaning data in the 'Name' column

#### Checks whether the "Name" column contains non-letter characters or other special characters that are irrelevant in people's names.

In [ ]:
import re

# Mengecek apakah kolom "Name" mengandung karakter-karakter yang bukan huruf
non_alphabet_chars = r'[^a-zA-Z\s\']'  # Ekspresi reguler untuk mencocokkan karakter yang bukan huruf kecuali karakter spasi (\s) dan kutip (\')

mask = dataset['Name'].str.contains(non_alphabet_chars, regex=True)
if mask.any():
    print("Kolom 'Name' mengandung karakter yang bukan huruf.")

Kolom 'Name' mengandung karakter yang bukan huruf.

#### Replaces unwanted characters with empty strings

In [ ]:
# Menggantikan karakter yang tidak diinginkan dengan string kosong
non_alphabet_chars = r'[^a-zA-Z]'  # Ekspresi reguler untuk mencocokkan karakter yang bukan huruf

dataset['Name'] = dataset['Name'].replace(non_alphabet_chars, '', regex=True)

#### Re-check the "name" column, if the column only contains letters it will not display anything

In [ ]:
non_alphabet_chars = r'[^a-zA-Z]'

mask = dataset['Name'].str.contains(non_alphabet_chars, regex=True)
if mask.any():
    print("Kolom 'Name' mengandung karakter yang bukan huruf.")

In [ ]:
dataset['Name'].info()

<class 'pandas.core.series.Series'>
RangeIndex: 930 entries, 0 to 929
Series name: Name
Non-Null Count  Dtype
--------------  -----
930 non-null    object
dtypes: object(1)
memory usage: 7.4+ KB

### Cleaning data in the 'Gender' column

#### Checking irregular writing in the 'Gender' column

In [ ]:
print(dataset['GENDER'].unique())

['M' 'Male' 'F' 'Pria' 'Man' 'Laki-laki' 'Perempuan' 'Wanita' 'Female']

#### Change 'M', 'Male', 'Pria', 'Man', 'Laki-laki' to 'Male'

In [ ]:
dataset['GENDER'] = dataset['GENDER'].replace(['M', 'Male', 'Pria', 'Man', 'Laki-laki'], 'Male')

#### Change 'F', 'Perempuan', 'Wanita', 'Female' to 'Female'

In [ ]:
dataset['GENDER'] = dataset['GENDER'].replace(['F', 'Perempuan', 'Wanita', 'Female'], 'Female')

#### Re-check the contents of the data in the 'Gender' column

In [ ]:
print(dataset['GENDER'].unique())

['Male' 'Female']

In [ ]:
dataset['GENDER'].info()

<class 'pandas.core.series.Series'>
RangeIndex: 930 entries, 0 to 929
Series name: GENDER
Non-Null Count  Dtype
--------------  -----
930 non-null    object
dtypes: object(1)
memory usage: 7.4+ KB

### Cleaning data in the 'EDU_LVL' column

#### Checking irregular writing in the 'Gender' column
Because no inappropriate writing was found, the contents of the data were considered clean

In [ ]:
print(dataset['EDU_LVL'].unique())

['S1' 'S2' 'SLTA' 'D3' 'SMA' 'D1' 'D4']

In [ ]:
dataset['EDU_LVL'].info()

<class 'pandas.core.series.Series'>
RangeIndex: 930 entries, 0 to 929
Series name: EDU_LVL
Non-Null Count  Dtype
--------------  -----
930 non-null    object
dtypes: object(1)
memory usage: 7.4+ KB

### Cleaning data in the 'JOB_CATEGORY' column

#### Checking irregular writing in the 'JOB_CATEGORY' column
Because no inappropriate writing was found, the contents of the data were considered clean

In [ ]:
print(dataset['JOB_CATEGORY'].unique())

['Functional Expert Band 2' 'Manager' 'Staff' 'Trainee' 'Supervisor'
 'Senior Staff Band 2' 'Senior Staff Band 3' 'Secretary'
 'Functional Expert Band 3' 'Senior Vice President' 'Vice President'
 'Senior Staff Band 5']

In [ ]:
dataset['JOB_CATEGORY'].info()

<class 'pandas.core.series.Series'>
RangeIndex: 930 entries, 0 to 929
Series name: JOB_CATEGORY
Non-Null Count  Dtype
--------------  -----
930 non-null    object
dtypes: object(1)
memory usage: 7.4+ KB

### Cleaning data in the 'AGE' column

In [ ]:
print(dataset['AGE'].unique())

['37 years, 2 month, 11 days' '42 years, 3 month, 14 days'
 '48 years, 4 month, 25 days' '50 years, 7 month, 2 days'
 '20 years, 4 month, 8 days' '37 years, 1 month, 17 days'
 '43 years, 1 month, 2 days' '27 years, 8 month, 14 days'
 '26 years, 1 month, 14 days' '32 years, 4 month, 1 days'
 '41 years, 3 month, 24 days' '40 years, 7 month, 22 days'
 '29 years, 5 month, 15 days' '32 years, 2 month, 6 days'
 '31 years, 8 month, 24 days' '40 years, 6 month, 21 days'
 '44 years, 2 month, 9 days' '35 years, 7 month, 12 days'
 '24 years, 9 month, 19 days' '34 years, 8 month, 10 days'
 '49 years, 6 month, 9 days' '47 years, 4 month, 10 days'
 '29 years, 6 month, 26 days' '46 years, 1 month, 13 days'
 '54 years, 2 month, 26 days' '33 years, 4 month, 15 days'
 '34 years, 5 month, 20 days' '40 years, 8 month, 15 days'
 '37 years, 2 month, 16 days' '42 years, 8 month, 14 days'
 '26 years, 9 month, 9 days' '33 years, 8 month, 12 days'
 '42 years, 1 month, 15 days' '44 years, 1 month, 26 days'
 '41 years, 7 month, 2 days' '45 years, 6 month, 25 days'
 '49 years, 8 month, 26 days' '46 years, 9 month, 9 days'
 '40 years, 2 month, 22 days' '37 years, 9 month, 6 days'
 '52 years, 6 month, 12 days' '27 years, 6 month, 4 days'
 '31 years, 5 month, 7 days' '37 years, 7 month, 2 days'
 '38 years, 2 month, 10 days' '46 years, 2 month, 3 days'
 '29 years, 5 month, 25 days' '55 years, 2 month, 12 days'
 '33 years, 7 month, 11 days' '28 years, 1 month, 3 days'
 '25 years, 8 month, 16 days' '39 years, 8 month, 26 days'
 '44 years, 7 month, 14 days' '37 years, 3 month, 5 days'
 '35 years, 6 month, 11 days' '49 years, 5 month, 20 days'
 '45 years, 4 month, 18 days' '41 years, 4 month, 21 days'
 '39 years, 8 month, 11 days' '47 years, 2 month, 18 days'
 '34 years, 2 month, 12 days' '25 years, 2 month, 3 days'
 '39 years, 6 month, 2 days' '26 years, 6 month, 7 days'
 '39 years, 5 month, 7 days' '25 years, 1 month, 14 days'
 '48 years, 6 month, 24 days' '38 years, 4 month, 24 days'
 '37 years, 2 month, 8 days' '37 years, 5 month, 2 days'
 '29 years, 7 month, 19 days' '37 years, 4 month, 19 days'
 '40 years, 6 month, 8 days' '35 years, 1 month, 22 days'
 '23 years, 3 month, 10 days' '41 years, 5 month, 26 days'
 '35 years, 4 month, 22 days' '47 years, 9 month, 17 days'
 '46 years, 9 month, 1 days' '36 years, 7 month, 19 days'
 '37 years, 7 month, 12 days' '52 years, 5 month, 3 days'
 '27 years, 2 month, 1 days' '40 years, 1 month, 17 days'
 '30 years, 7 month, 19 days' '35 years, 5 month, 6 days'
 '29 years, 4 month, 14 days' '38 years, 3 month, 20 days'
 '53 years, 7 month, 13 days' '37 years, 7 month, 6 days'
 '31 years, 8 month, 14 days' '23 years, 1 month, 2 days'
 '41 years, 8 month, 14 days' '36 years, 9 month, 16 days'
 '45 years, 6 month, 2 days' '50 years, 7 month, 8 days'
 '30 years, 2 month, 14 days' '34 years, 7 month, 18 days'
 '34 years, 7 month, 4 days' '30 years, 6 month, 23 days'
 '40 years, 7 month, 16 days' '30 years, 3 month, 15 days'
 '46 years, 5 month, 17 days' '48 years, 1 month, 16 days'
 '30 years, 4 month, 15 days' '37 years, 8 month, 18 days'
 '39 years, 7 month, 12 days' '25 years, 6 month, 25 days'
 '36 years, 8 month, 16 days' '39 years, 7 month, 9 days'
 '27 years, 4 month, 17 days' '26 years, 3 month, 14 days'
 '37 years, 5 month, 12 days' '39 years, 4 month, 10 days'
 '25 years, 1 month, 9 days' '45 years, 9 month, 21 days'
 '44 years, 7 month, 11 days' '27 years, 7 month, 11 days'
 '38 years, 2 month, 26 days' '42 years, 3 month, 25 days'
 '26 years, 3 month, 26 days' '47 years, 6 month, 19 days'
 '41 years, 5 month, 8 days' '29 years, 5 month, 8 days'
 '44 years, 2 month, 7 days' '41 years, 3 month, 19 days'
 '31 years, 5 month, 6 days' '39 years, 2 month, 2 days'
 '44 years, 6 month, 24 days' '31 years, 2 month, 23 days'
 '35 years, 9 month, 23 days' '39 years, 2 month, 18 days'
 '43 years, 2 month, 14 days' '37 years, 4 month, 1 days'
 '41 years, 5 month, 14 days' '44 years, 3 month, 23 days'
 '40 years, 6 month, 20 days' '34 years, 1 month, 5 days'
 '25 years, 3 month, 16 days' '24 years, 7 month, 22 days'
 '27 years, 4 month, 5 days' '36 years, 1 month, 5 days'
 '38 years, 1 month, 25 days' '24 years, 3 month, 22 days'
 '35 years, 4 month, 26 days' '34 years, 3 month, 23 days'
 '49 years, 2 month, 1 days' '43 years, 5 month, 25 days'
 '28 years, 5 month, 6 days' '36 years, 9 month, 4 days'
 '34 years, 5 month, 18 days' '26 years, 5 month, 25 days'
 '28 years, 2 month, 15 days' '46 years, 1 month, 4 days'
 '43 years, 2 month, 19 days' '29 years, 6 month, 20 days'
 '42 years, 3 month, 12 days' '32 years, 8 month, 21 days'
 '32 years, 6 month, 5 days' '31 years, 2 month, 5 days'
 '49 years, 6 month, 13 days' '28 years, 3 month, 15 days'
 '46 years, 7 month, 24 days' '37 years, 2 month, 21 days'
 '51 years, 4 month, 17 days' '48 years, 6 month, 12 days'
 '43 years, 9 month, 22 days' '33 years, 7 month, 24 days'
 '37 years, 1 month, 9 days' '41 years, 2 month, 4 days'
 '42 years, 9 month, 26 days' '40 years, 8 month, 17 days'
 '30 years, 6 month, 26 days' '31 years, 6 month, 11 days'
 '36 years, 2 month, 20 days' '26 years, 4 month, 7 days'
 '38 years, 5 month, 20 days' '29 years, 9 month, 16 days'
 '39 years, 7 month, 26 days' '43 years, 8 month, 2 days'
 '39 years, 5 month, 12 days' '38 years, 8 month, 21 days'
 '32 years, 6 month, 3 days' '26 years, 8 month, 24 days'
 '23 years, 1 month, 10 days' '39 years, 6 month, 7 days'
 '25 years, 3 month, 24 days' '28 years, 9 month, 14 days'
 '32 years, 1 month, 1 days' '38 years, 9 month, 11 days'
 '43 years, 6 month, 25 days' '46 years, 5 month, 15 days'
 '23 years, 5 month, 2 days' '35 years, 9 month, 19 days'
 '31 years, 8 month, 10 days' '37 years, 2 month, 20 days'
 '32 years, 8 month, 7 days' '25 years, 9 month, 8 days'
 '30 years, 7 month, 14 days' '34 years, 5 month, 21 days'
 '48 years, 9 month, 7 days' '42 years, 1 month, 9 days'
 '30 years, 1 month, 3 days' '43 years, 9 month, 7 days'
 '50 years, 8 month, 26 days' '27 years, 5 month, 25 days'
 '37 years, 8 month, 10 days' '41 years, 4 month, 16 days'
 '35 years, 7 month, 26 days' '37 years, 5 month, 26 days'
 '39 years, 4 month, 11 days' '46 years, 6 month, 25 days'
 '41 years, 6 month, 20 days' '37 years, 3 month, 16 days'
 '24 years, 1 month, 26 days' '31 years, 3 month, 15 days'
 '26 years, 4 month, 24 days' '42 years, 9 month, 18 days'
 '27 years, 3 month, 14 days' '44 years, 8 month, 20 days'
 '27 years, 5 month, 12 days' '31 years, 5 month, 17 days'
 '31 years, 2 month, 25 days' '25 years, 9 month, 6 days'
 '37 years, 7 month, 25 days' '42 years, 8 month, 21 days'
 '49 years, 3 month, 11 days' '45 years, 4 month, 26 days'
 '35 years, 8 month, 19 days' '31 years, 5 month, 13 days'
 '42 years, 8 month, 9 days' '47 years, 5 month, 2 days'
 '48 years, 5 month, 6 days' '32 years, 8 month, 2 days'
 '47 years, 7 month, 5 days' '42 years, 7 month, 16 days'
 '38 years, 8 month, 20 days' '41 years, 4 month, 10 days'
 '28 years, 1 month, 12 days' '26 years, 9 month, 6 days'
 '48 years, 3 month, 25 days' '24 years, 9 month, 23 days'
 '46 years, 8 month, 8 days' '24 years, 9 month, 4 days'
 '49 years, 1 month, 26 days' '37 years, 9 month, 5 days'
 '25 years, 4 month, 21 days' '48 years, 1 month, 3 days'
 '42 years, 9 month, 11 days' '27 years, 1 month, 26 days'
 '42 years, 6 month, 3 days' '41 years, 5 month, 6 days'
 '37 years, 6 month, 16 days' '28 years, 7 month, 8 days'
 '28 years, 3 month, 8 days' '49 years, 9 month, 8 days'
 '42 years, 7 month, 8 days' '34 years, 3 month, 13 days'
 '26 years, 6 month, 23 days' '35 years, 6 month, 8 days'
 '35 years, 4 month, 20 days' '37 years, 6 month, 1 days'
 '42 years, 6 month, 20 days' '43 years, 6 month, 6 days'
 '30 years, 1 month, 8 days' '46 years, 4 month, 6 days'
 '26 years, 8 month, 10 days' '34 years, 3 month, 1 days'
 '37 years, 4 month, 25 days' '26 years, 1 month, 20 days'
 '31 years, 8 month, 25 days' '47 years, 4 month, 12 days'
 '42 years, 1 month, 16 days' '55 years, 4 month, 2 days'
 '25 years, 9 month, 7 days' '28 years, 5 month, 10 days'
 '47 years, 6 month, 3 days' '36 years, 7 month, 25 days'
 '33 years, 2 month, 8 days' '38 years, 2 month, 14 days'
 '38 years, 6 month, 26 days' '40 years, 7 month, 11 days'
 '29 years, 2 month, 22 days' '26 years, 7 month, 21 days'
 '46 years, 1 month, 17 days' '25 years, 3 month, 1 days'
 '28 years, 3 month, 22 days' '30 years, 8 month, 11 days'
 '43 years, 2 month, 9 days' '41 years, 8 month, 10 days'
 '40 years, 4 month, 23 days' '35 years, 5 month, 23 days'
 '35 years, 1 month, 19 days' '28 years, 6 month, 13 days'
 '49 years, 7 month, 5 days' '29 years, 3 month, 6 days'
 '29 years, 3 month, 15 days' '31 years, 2 month, 9 days'
 '47 years, 1 month, 13 days' '40 years, 7 month, 14 days'
 '25 years, 7 month, 26 days' '32 years, 1 month, 10 days'
 '27 years, 1 month, 4 days' '41 years, 2 month, 16 days'
 '28 years, 7 month, 9 days' '45 years, 8 month, 24 days'
 '46 years, 6 month, 9 days' '40 years, 7 month, 21 days'
 '37 years, 4 month, 17 days' '24 years, 9 month, 20 days'
 '47 years, 8 month, 25 days' '37 years, 8 month, 3 days'
 '42 years, 1 month, 1 days' '44 years, 8 month, 25 days'
 '37 years, 6 month, 21 days' '47 years, 4 month, 19 days'
 '36 years, 9 month, 10 days' '40 years, 3 month, 26 days'
 '37 years, 9 month, 22 days' '28 years, 9 month, 1 days'
 '28 years, 8 month, 18 days' '26 years, 4 month, 2 days'
 '36 years, 9 month, 6 days' '38 years, 9 month, 13 days'
 '42 years, 5 month, 12 days' '46 years, 1 month, 23 days'
 '30 years, 2 month, 25 days' '52 years, 3 month, 17 days'
 '24 years, 3 month, 4 days' '37 years, 3 month, 22 days'
 '25 years, 2 month, 9 days' '45 years, 9 month, 12 days'
 '27 years, 9 month, 22 days' '29 years, 7 month, 6 days'
 '29 years, 9 month, 12 days' '24 years, 9 month, 7 days'
 '33 years, 1 month, 3 days' '42 years, 2 month, 18 days'
 '28 years, 7 month, 4 days' '36 years, 6 month, 7 days'
 '50 years, 8 month, 18 days' '46 years, 9 month, 26 days'
 '47 years, 5 month, 19 days' '31 years, 8 month, 21 days'
 '43 years, 5 month, 11 days' '25 years, 9 month, 12 days'
 '36 years, 5 month, 6 days' '30 years, 3 month, 3 days'
 '37 years, 1 month, 12 days' '25 years, 7 month, 23 days'
 '34 years, 3 month, 15 days' '35 years, 6 month, 24 days'
 '38 years, 9 month, 14 days' '24 years, 3 month, 26 days'
 '29 years, 2 month, 2 days' '38 years, 6 month, 11 days'
 '49 years, 5 month, 23 days' '27 years, 4 month, 11 days'
 '42 years, 2 month, 15 days' '35 years, 6 month, 17 days'
 '45 years, 6 month, 16 days' '39 years, 1 month, 4 days'
 '33 years, 5 month, 19 days' '42 years, 8 month, 22 days'
 '41 years, 2 month, 23 days' '35 years, 4 month, 3 days'
 '32 years, 1 month, 6 days' '37 years, 9 month, 15 days'
 '29 years, 3 month, 3 days' '40 years, 8 month, 26 days'
 '41 years, 7 month, 11 days' '42 years, 2 month, 24 days'
 '27 years, 1 month, 21 days' '29 years, 3 month, 13 days'
 '49 years, 7 month, 12 days' '30 years, 8 month, 2 days'
 '35 years, 8 month, 4 days' '39 years, 6 month, 9 days'
 '39 years, 7 month, 10 days' '43 years, 4 month, 24 days'
 '37 years, 7 month, 26 days' '49 years, 4 month, 16 days'
 '39 years, 9 month, 2 days' '28 years, 5 month, 18 days'
 '38 years, 2 month, 12 days' '26 years, 5 month, 22 days'
 '41 years, 7 month, 18 days' '41 years, 1 month, 20 days'
 '31 years, 7 month, 18 days' '28 years, 4 month, 11 days'
 '38 years, 6 month, 12 days' '37 years, 7 month, 9 days'
 '39 years, 2 month, 12 days' '51 years, 2 month, 21 days'
 '44 years, 5 month, 19 days' '49 years, 5 month, 7 days'
 '41 years, 2 month, 5 days' '27 years, 9 month, 10 days'
 '31 years, 6 month, 20 days' '32 years, 3 month, 15 days'
 '25 years, 9 month, 18 days' '49 years, 8 month, 25 days'
 '32 years, 8 month, 9 days' '28 years, 9 month, 21 days'
 '31 years, 3 month, 10 days' '26 years, 4 month, 25 days'
 '27 years, 1 month, 1 days' '31 years, 6 month, 19 days'
 '40 years, 5 month, 22 days' '24 years, 5 month, 10 days'
 '36 years, 9 month, 25 days' '35 years, 6 month, 2 days'
 '33 years, 2 month, 13 days' '31 years, 4 month, 9 days'
 '36 years, 7 month, 4 days' '44 years, 1 month, 23 days'
 '23 years, 3 month, 7 days' '38 years, 9 month, 23 days'
 '38 years, 7 month, 24 days' '43 years, 6 month, 5 days'
 '26 years, 3 month, 25 days' '28 years, 1 month, 4 days'
 '39 years, 4 month, 25 days' '27 years, 9 month, 24 days'
 '53 years, 5 month, 4 days' '28 years, 7 month, 16 days'
 '30 years, 3 month, 9 days' '31 years, 7 month, 4 days'
 '44 years, 7 month, 21 days' '41 years, 7 month, 7 days'
 '31 years, 7 month, 22 days' '41 years, 3 month, 12 days'
 '26 years, 5 month, 17 days' '31 years, 5 month, 12 days'
 '28 years, 7 month, 18 days' '25 years, 5 month, 4 days'
 '40 years, 6 month, 10 days' '46 years, 4 month, 26 days'
 '37 years, 1 month, 24 days' '22 years, 8 month, 17 days'
 '39 years, 9 month, 17 days' '37 years, 8 month, 15 days'
 '35 years, 8 month, 10 days' '39 years, 1 month, 3 days'
 '25 years, 8 month, 24 days' '40 years, 3 month, 13 days'
 '33 years, 1 month, 19 days' '32 years, 8 month, 4 days'
 '54 years, 3 month, 9 days' '33 years, 2 month, 22 days'
 '29 years, 6 month, 7 days' '36 years, 5 month, 13 days'
 '25 years, 5 month, 11 days' '30 years, 9 month, 10 days'
 '36 years, 3 month, 14 days' '46 years, 8 month, 16 days'
 '30 years, 6 month, 20 days' '25 years, 1 month, 23 days'
 '42 years, 8 month, 1 days' '45 years, 2 month, 22 days'
 '39 years, 9 month, 9 days' '27 years, 8 month, 6 days'
 '48 years, 5 month, 8 days' '34 years, 3 month, 9 days'
 '32 years, 5 month, 17 days' '25 years, 3 month, 25 days'
 '50 years, 7 month, 20 days' '39 years, 3 month, 7 days'
 '48 years, 2 month, 10 days' '25 years, 3 month, 13 days'
 '35 years, 9 month, 2 days' '25 years, 5 month, 26 days'
 '25 years, 2 month, 20 days' '41 years, 7 month, 1 days'
 '36 years, 4 month, 18 days' '36 years, 8 month, 14 days'
 '36 years, 3 month, 7 days' '39 years, 8 month, 19 days'
 '31 years, 6 month, 21 days' '39 years, 3 month, 4 days'
 '41 years, 4 month, 2 days' '49 years, 7 month, 11 days'
 '32 years, 3 month, 6 days' '29 years, 5 month, 3 days'
 '42 years, 5 month, 13 days' '40 years, 9 month, 1 days'
 '40 years, 6 month, 25 days' '34 years, 4 month, 22 days'
 '51 years, 1 month, 8 days' '27 years, 6 month, 9 days'
 '37 years, 7 month, 22 days' '36 years, 5 month, 18 days'
 '37 years, 3 month, 2 days' '27 years, 7 month, 1 days'
 '45 years, 4 month, 22 days' '47 years, 9 month, 4 days'
 '28 years, 3 month, 16 days' '43 years, 4 month, 1 days'
 '30 years, 5 month, 1 days' '25 years, 2 month, 26 days'
 '43 years, 2 month, 12 days' '51 years, 6 month, 7 days'
 '51 years, 7 month, 21 days' '38 years, 5 month, 14 days'
 '45 years, 8 month, 14 days' '27 years, 9 month, 25 days'
 '30 years, 8 month, 21 days' '30 years, 7 month, 20 days'
 '38 years, 5 month, 10 days' '26 years, 3 month, 8 days'
 '27 years, 7 month, 15 days' '53 years, 3 month, 22 days'
 '42 years, 8 month, 8 days' '28 years, 2 month, 22 days'
 '30 years, 7 month, 7 days' '44 years, 3 month, 10 days'
 '32 years, 4 month, 4 days' '41 years, 5 month, 17 days'
 '38 years, 9 month, 21 days' '37 years, 1 month, 21 days'
 '46 years, 9 month, 8 days' '22 years, 6 month, 19 days'
 '39 years, 9 month, 11 days' '28 years, 1 month, 2 days'
 '37 years, 5 month, 16 days' '30 years, 5 month, 16 days'
 '39 years, 6 month, 25 days' '46 years, 1 month, 12 days'
 '40 years, 1 month, 11 days' '48 years, 5 month, 20 days'
 '39 years, 5 month, 26 days' '43 years, 4 month, 23 days'
 '34 years, 8 month, 3 days' '38 years, 6 month, 15 days'
 '27 years, 8 month, 25 days' '43 years, 7 month, 1 days'
 '47 years, 5 month, 18 days' '35 years, 7 month, 19 days'
 '50 years, 5 month, 7 days' '26 years, 4 month, 10 days'
 '40 years, 9 month, 10 days' '51 years, 2 month, 18 days'
 '30 years, 9 month, 2 days' '49 years, 8 month, 24 days'
 '46 years, 2 month, 14 days' '36 years, 1 month, 7 days'
 '37 years, 8 month, 5 days' '35 years, 2 month, 9 days'
 '24 years, 4 month, 17 days' '25 years, 2 month, 24 days'
 '38 years, 3 month, 16 days' '43 years, 6 month, 2 days'
 '50 years, 6 month, 16 days' '48 years, 7 month, 18 days'
 '42 years, 3 month, 15 days' '35 years, 3 month, 18 days'
 '50 years, 9 month, 9 days' '47 years, 2 month, 12 days'
 '38 years, 7 month, 8 days' '43 years, 1 month, 25 days'
 '32 years, 8 month, 19 days' '26 years, 3 month, 9 days'
 '50 years, 2 month, 3 days' '39 years, 2 month, 7 days'
 '42 years, 4 month, 3 days' '27 years, 8 month, 9 days'
 '38 years, 8 month, 17 days' '25 years, 3 month, 21 days'
 '46 years, 1 month, 25 days' '25 years, 6 month, 24 days'
 '45 years, 1 month, 5 days' '44 years, 8 month, 16 days'
 '47 years, 4 month, 6 days' '48 years, 9 month, 3 days'
 '39 years, 4 month, 18 days' '38 years, 4 month, 9 days'
 '50 years, 1 month, 22 days' '40 years, 9 month, 9 days'
 '38 years, 8 month, 13 days' '41 years, 8 month, 22 days'
 '38 years, 5 month, 11 days' '29 years, 5 month, 11 days'
 '39 years, 6 month, 23 days' '30 years, 6 month, 9 days'
 '32 years, 1 month, 26 days' '42 years, 9 month, 4 days'
 '40 years, 4 month, 18 days' '47 years, 5 month, 23 days'
 '35 years, 8 month, 2 days' '30 years, 3 month, 14 days'
 '39 years, 6 month, 19 days' '40 years, 1 month, 5 days'
 '49 years, 9 month, 1 days' '26 years, 6 month, 1 days'
 '43 years, 7 month, 11 days' '50 years, 6 month, 11 days'
 '35 years, 2 month, 17 days' '40 years, 1 month, 13 days'
 '26 years, 7 month, 6 days' '29 years, 2 month, 12 days'
 '36 years, 2 month, 11 days' '55 years, 8 month, 23 days'
 '25 years, 1 month, 15 days' '43 years, 5 month, 23 days'
 '38 years, 2 month, 15 days' '54 years, 6 month, 3 days'
 '51 years, 5 month, 20 days' '41 years, 4 month, 4 days'
 '25 years, 8 month, 22 days' '50 years, 8 month, 19 days'
 '37 years, 2 month, 24 days' '34 years, 8 month, 18 days'
 '24 years, 1 month, 22 days' '48 years, 7 month, 12 days'
 '43 years, 6 month, 12 days' '45 years, 5 month, 18 days'
 '25 years, 5 month, 16 days' '26 years, 7 month, 8 days'
 '44 years, 6 month, 8 days' '28 years, 1 month, 10 days'
 '38 years, 9 month, 16 days' '32 years, 5 month, 12 days'
 '30 years, 4 month, 24 days' '31 years, 1 month, 2 days'
 '42 years, 3 month, 18 days' '24 years, 1 month, 5 days'
 '44 years, 5 month, 4 days' '32 years, 2 month, 1 days'
 '55 years, 3 month, 1 days' '31 years, 9 month, 5 days'
 '42 years, 2 month, 3 days' '37 years, 6 month, 22 days'
 '24 years, 4 month, 9 days' '38 years, 7 month, 15 days'
 '45 years, 5 month, 13 days' '25 years, 1 month, 2 days'
 '38 years, 4 month, 18 days' '37 years, 1 month, 7 days'
 '36 years, 4 month, 7 days' '28 years, 2 month, 20 days'
 '31 years, 2 month, 10 days' '38 years, 9 month, 9 days'
 '43 years, 3 month, 14 days' '50 years, 9 month, 19 days'
 '33 years, 6 month, 1 days' '36 years, 4 month, 23 days'
 '41 years, 6 month, 8 days' '37 years, 7 month, 13 days'
 '41 years, 1 month, 10 days' '48 years, 7 month, 9 days'
 '30 years, 6 month, 18 days' '29 years, 3 month, 18 days'
 '39 years, 5 month, 1 days' '39 years, 1 month, 6 days'
 '24 years, 6 month, 16 days' '41 years, 4 month, 13 days'
 '41 years, 5 month, 22 days' '32 years, 4 month, 16 days'
 '24 years, 4 month, 7 days' '48 years, 8 month, 23 days'
 '24 years, 7 month, 25 days' '47 years, 7 month, 2 days'
 '36 years, 2 month, 10 days' '29 years, 5 month, 7 days'
 '33 years, 1 month, 20 days' '29 years, 1 month, 22 days'
 '51 years, 9 month, 13 days' '38 years, 4 month, 11 days'
 '36 years, 5 month, 9 days' '28 years, 2 month, 26 days'
 '28 years, 5 month, 14 days' '26 years, 5 month, 16 days'
 '27 years, 3 month, 2 days' '34 years, 6 month, 11 days'
 '29 years, 6 month, 5 days' '30 years, 4 month, 8 days'
 '32 years, 7 month, 17 days' '41 years, 6 month, 4 days'
 '33 years, 7 month, 9 days' '38 years, 3 month, 4 days'
 '43 years, 3 month, 10 days' '26 years, 9 month, 10 days'
 '33 years, 2 month, 19 days' '39 years, 9 month, 24 days'

#### Separates the age column into a component of the year, month and day

In [ ]:
import re

def extract_age_components(age_str):
    age_components = re.findall(r'\d+', age_str)
    years = int(age_components[0])
    months = int(age_components[1])
    days = int(age_components[2])
    return years, months, days

dataset['AGE'].apply(extract_age_components)

0      (37, 2, 11)
1      (42, 3, 14)
2      (48, 4, 25)
3       (50, 7, 2)
4       (20, 4, 8)
          ...
925     (47, 6, 3)
926     (29, 4, 3)
927     (46, 8, 3)
928    (54, 1, 18)
929    (33, 6, 13)
Name: AGE, Length: 930, dtype: object

#### Calculate the date of birth based on components of the year, month, and day
In this code, I changed Months and Years into the day by multiplying it with a rough approach factor. So, I assume every month contains 30 days and every year contains 365 days. Please note that this is an estimated approach and may not give accurate results if you want to do a more appropriate calculation. However, if the goal is to provide an estimated date of birth based on the age given, this approach can provide acceptable results. Then, I use the date() method to get a date object without time information, and then use isoformat() to change the date into the format "YYYY-MM-DD".

In [ ]:
from datetime import datetime, timedelta

def calculate_birthdate(years, months, days):
    reference_date = datetime.now()  # Menggunakan hari ini sebagai referensi
    total_days = years * 365 + months * 30 + days  # Mengkonversi tahun dan bulan ke hari
    birthdate = reference_date - timedelta(days=total_days)
    return birthdate.date().isoformat()

dataset['Birthdate'] = dataset['AGE'].apply(lambda age_str: calculate_birthdate(*extract_age_components(age_str)))

In [ ]:
dataset['Birthdate'].head(10)

0    1986-04-17
1    1981-03-16
2    1975-02-05
3    1972-11-30
4    2003-02-15
5    1986-05-11
6    1980-05-27
7    1995-10-14
8    1997-05-11
9    1991-02-25
Name: Birthdate, dtype: object

In [ ]:
dataset['Birthdate'].info()

<class 'pandas.core.series.Series'>
RangeIndex: 930 entries, 0 to 929
Series name: Birthdate
Non-Null Count  Dtype
--------------  -----
930 non-null    object
dtypes: object(1)
memory usage: 7.4+ KB

#### Drop the 'age' column from dataset and change the sequence of the column so that the 'Birthdate' column is in the position that was previously occupied by the 'Age' column column

In [ ]:
dataset = dataset.drop('AGE', axis=1)
dataset = dataset.reindex(columns=['Employee_ID', 'Name', 'GENDER', 'EDU_LVL', 'JOB_CATEGORY', 'Birthdate',	'Score',	'Phone Number',	'Domicile_Province',	'First_Day_Employment'])

In [ ]:
dataset.head()

,Employee_ID,Name,GENDER,EDU_LVL,JOB_CATEGORY,Birthdate,Score,Phone Number,Domicile_Province,First_Day_Employment
0,1,ClaireGute,Male,S1,Functional Expert Band 2,1986-04-17,3.98,628315242420,DKI Jakarta,2006-02-16
1,2,DarrinVanHuff,Male,S2,Manager,1981-03-16,4.15,85246790036,Jakarta,12-20-2002
2,3,SeanODonnell,Male,SLTA,Staff,1975-02-05,3.98,85246833311,JKT,1997-08-20
3,4,BrosinaHoffman,Male,S2,Manager,1972-11-30,3.23,85246990032,West Java,06/19/1993
4,5,AndrewAllen,Female,S1,Trainee,2003-02-15,-,85247028027,Jawa Barat,06-25-2020

### Cleaning data in the 'Score' column

#### Check information from the column

In [ ]:
dataset['Score'].info()

<class 'pandas.core.series.Series'>
RangeIndex: 930 entries, 0 to 929
Series name: Score
Non-Null Count  Dtype
--------------  -----
920 non-null    object
dtypes: object(1)
memory usage: 7.4+ KB

#### Checking the null in the 'Score' column

In [ ]:
dataset['Score'].isnull().sum()

10

#### Convert the 'Score' column to the numerical data type
Conversion of the 'Score' column to the numerical data type is needed because if there is a value of a string type in the column, then the operation to replace the null value with an average value will cause an error.

In [ ]:
dataset['Score'] = pd.to_numeric(dataset['Score'], errors='coerce')

#### Replace the NULL in the 'Score' column with an average value
The reason to replace the null value with an average value of a dataset column is to fill the lost value with an estimated that can represent the characteristics of existing data. Replacing it with an average value is one of the commonly used approaches.

In [ ]:
dataset['Score'] = dataset['Score'].fillna(dataset['Score'].mean())

#### Re-checking null in the 'score' column

In [ ]:
dataset['Score'].isnull().sum()

0

### Cleaning data in the 'Phone Number' column

In [ ]:
dataset['Phone Number'].info()

<class 'pandas.core.series.Series'>
RangeIndex: 930 entries, 0 to 929
Series name: Phone Number
Non-Null Count  Dtype
--------------  -----
930 non-null    int64
dtypes: int64(1)
memory usage: 7.4 KB

#### Change the data type column 'Phone Number' to String

In [ ]:
dataset['Phone Number'] = dataset['Phone Number'].astype(str)

#### Extraction telephone number patterns and count the number of telephone number emergence

In [ ]:
pola = r'^(\+62|^08|^62|^8)'
dataset['Phone Number'].str.extract(pola).value_counts()

8     557
62    373
dtype: int64

#### Change unwanted prefix with a consistent prefix

In [ ]:
dataset['Phone Number'] = dataset['Phone Number'].str.replace(pola, '+62', regex=True)
dataset['Phone Number'].str.extract(pola).value_counts()

+62    930
dtype: int64

### Cleaning data in the 'Domicile_Province' column

In [ ]:
print(dataset['Domicile_Province'].unique())

['DKI Jakarta' 'Jakarta' 'JKT' 'West Java' 'Jawa Barat' 'Jabar' 'Bandung'
 'Jakarta Selatan' 'South Jakarta' 'East Jakarta' 'Purwokerto'
 'Purwakarta' 'Yogyakarta' 'DIY' 'Depok' 'Bogor' 'Bekasi'
 'Tangerang Selatan' 'Kalideres' 'Sukabumi' 'Bali' 'Denpasar']

#### Make a Dictionary for Mapping

In [ ]:
mapping = {
    'DKI Jakarta': 'DKI Jakarta',
    'Jakarta': 'DKI Jakarta',
    'JKT': 'DKI Jakarta',
    'West Java': 'Jawa Barat',
    'Jawa Barat': 'Jawa Barat',
    'Jabar': 'Jawa Barat',
    'Bandung': 'Jawa Barat',
    'Jakarta Selatan': 'DKI Jakarta',
    'South Jakarta': 'DKI Jakarta',
    'East Jakarta': 'DKI Jakarta',
    'Purwokerto': 'Jawa Tengah',
    'Purwakarta': 'Jawa Barat',
    'Yogyakarta': 'DI Yogyakarta',
    'DIY': 'DI Yogyakarta',
    'Depok': 'Jawa Barat',
    'Bogor': 'Jawa Barat',
    'Bekasi': 'Jawa Barat',
    'Tangerang Selatan': 'Banten',
    'Kalideres': 'DKI Jakarta',
    'Sukabumi': 'Jawa Barat',
    'Bali': 'Bali',
    'Denpasar': 'Bali'
}

#### Change the column value 'Domicile_Province' using mapping

In [ ]:
dataset['Domicile_Province'] = dataset['Domicile_Province'].map(mapping)

In [ ]:
print(dataset['Domicile_Province'].unique())

['DKI Jakarta' 'Jawa Barat' 'Jawa Tengah' 'DI Yogyakarta' 'Banten' 'Bali']

### Cleaning data in the 'First_Day_Employment' column

#### Determine the expected pattern from the date format

In [ ]:
dataset['First_Day_Employment'].isnull().value_counts()

False    930
Name: First_Day_Employment, dtype: int64

In [ ]:
dataset['First_Day_Employment'].head(10)

0    2006-02-16
1    12-20-2002
2    1997-08-20
3    06/19/1993
4    06-25-2020
5    02-15-2006
6    2003-03-22
7    2020-06-19
8    02/24/2020
9    10-25-2015
Name: First_Day_Employment, dtype: object

#### Make a special function to convert the date format

In [ ]:
from dateutil.parser import parse
def custom_date_parser(date_str):
    try:
        return parse(date_str)
    except:
        return pd.NaT

#### Conversion Value Using Special Functions

In [ ]:
dataset['First_Day_Employment'] = dataset['First_Day_Employment'].apply(custom_date_parser)

#### Then, print data and check whether there is data that is in the column

In [ ]:
dataset['First_Day_Employment'].head(10)

0   2006-02-16
1   2002-12-20
2   1997-08-20
3   1993-06-19
4   2020-06-25
5   2006-02-15
6   2003-03-22
7   2020-06-19
8   2020-02-24
9   2015-10-25
Name: First_Day_Employment, dtype: datetime64[ns]

In [ ]:
dataset['First_Day_Employment'].isnull().value_counts()

False    930
Name: First_Day_Employment, dtype: int64

### Check data after cleaning

In [ ]:
dataset.head(20)

,Employee_ID,Name,GENDER,EDU_LVL,JOB_CATEGORY,Birthdate,Score,Phone Number,Domicile_Province,First_Day_Employment
0,1,ClaireGute,Male,S1,Functional Expert Band 2,1986-04-17,3.980000,+628315242420,DKI Jakarta,2006-02-16
1,2,DarrinVanHuff,Male,S2,Manager,1981-03-16,4.150000,+625246790036,DKI Jakarta,2002-12-20
2,3,SeanODonnell,Male,SLTA,Staff,1975-02-05,3.980000,+625246833311,DKI Jakarta,1997-08-20
3,4,BrosinaHoffman,Male,S2,Manager,1972-11-30,3.230000,+625246990032,Jawa Barat,1993-06-19
4,5,AndrewAllen,Female,S1,Trainee,2003-02-15,3.963879,+625247028027,Jawa Barat,2020-06-25
5,6,IreneMaddox,Male,S1,Supervisor,1986-05-11,4.660000,+625247198103,Jawa Barat,2006-02-15
6,7,HaroldPawlan,Male,S1,Senior Staff Band 2,1980-05-27,4.710000,+6285247276106,Jawa Barat,2003-03-22
7,8,PeteKriz,Male,S1,Staff,1995-10-14,4.050000,+6285247353711,DKI Jakarta,2020-06-19
8,9,AlejandroGrove,Male,S1,Staff,1997-05-11,4.860000,+6285247484084,DKI Jakarta,2020-02-24
9,10,ZuschussDonatelli,Female,S1,Staff,1991-02-25,3.760000,+6285247594109,DKI Jakarta,2015-10-25
10,11,KenBlack,Female,D3,Staff,1982-03-06,3.420000,+6285247668025,Jawa Tengah,2005-06-23
11,12,SandraFlanagan,Male,S1,Supervisor,1982-11-08,4.070000,+6285247719140,Jawa Barat,2005-07-17
12,13,EmilyBurns,Male,S1,Supervisor,1994-01-11,4.290000,+6285247884057,DI Yogyakarta,2015-03-26
13,14,EricHoffmann,Female,S1,Functional Expert Band 2,1991-04-21,4.000000,+625247990049,DI Yogyakarta,2011-01-20
14,15,TracyBlumstein,Female,S1,Staff,1991-10-05,4.070000,+625247919140,Jawa Barat,2015-09-16
15,16,MattAbelman,Male,D3,Manager,1982-12-09,3.830000,+625247977095,Jawa Barat,2003-05-26
16,17,GeneHale,Male,S1,Functional Expert Band 2,1979-04-21,4.260000,+625247975080,Jawa Barat,2002-11-19
17,18,SteveNguyen,Male,S1,Supervisor,1987-11-17,3.900000,+625247977041,Banten,2010-06-26
18,19,LindaCazamias,Female,S1,Staff,1998-09-08,3.980000,+625247960540,DKI Jakarta,2020-12-21
19,20,RubenAusman,Male,S2,Manager,1988-10-19,4.140000,+625247990049,Jawa Barat,2012-03-20

#### Export cleaned dataset to .csv

In [ ]:
dataset.to_csv('drive/MyDrive/DattabotTechnicalTest_DataEngineer/cleaned_dataset.csv', index=False)